first_app/app/controllers/order_items_controller.rb

    def create
        @order = current_order
        @order_item = @order.order_items.new(order_params)
        @order.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES (?, ?, ?)  [["subtotal", 0.0], ["created_at", "2021-11-15 14:02:02.128929"], ["updated_at", "2021-11-15 14:02:02.128929"]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "total", "unit_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantity", 3], ["product_id", 2], ["order_id", 1], ["total", 0.0], ["unit_price", 0.0], ["created_at", "2021-11-16 16:07:17.334820"], ["updated_at", "2021-11-16 16:07:17.334820"]]

    def update
        @order = current_order
        @order_item = @order.order_items.find(params[:id])
        @order_item.update_attributes(order_params)
---
UPDATE "orders" SET "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["subtotal", 20.0], ["updated_at", "2021-11-16 16:07:40.089931"], ["id", 1]]