first_app/app/controllers/products_controller.rb

INSERT INTO "products" ("title", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Spark Boots"], ["price", 0.0], ["created_at", "2021-11-15 08:08:25.769481"], ["updated_at", "2021-11-15 08:08:25.769481"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save