first_app/app/views/shops/index.html.erb


<%= link_to "#{current_order.order_items.size} items with a value of$", cards_path%>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]