first_app/app/helpers/application_helper.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_order
        if !session[:order_id].nil?
            Order.find(session[:order_id])